dimension ordinate origin visibility
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public OrdinateOriginVisibility OriginVisibility { get; set; }
  Visual Basic
Public Property OriginVisibility As OrdinateOriginVisibility
	Get
	Set
  Visual C++
public:
property OrdinateOriginVisibility OriginVisibility {
	OrdinateOriginVisibility get ();
	void set (OrdinateOriginVisibility value);
}
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   When setting this property: A value passed for an enumeration argument is not a member of that enumeration
 See Also
  OrdinateDimensionSetting Class
  Autodesk.Revit.DB Namespace